uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
// test_stm32f4_power - the reference bench suite for the STM32F4's
// STOPPING half: stm32f4/pwr.hpp (RM0390 ch. 5 on the bench part, RM0090
// ch. 5 and RM0383 ch. 5 on its siblings, the whole of it),
// stm32f4/sleep.hpp (util/power.hpp's depth ladder on this silicon, and
// the RTC-backed timebase that lifts its restriction) and the DYNAMIC
// CLOCK the way down needs (stm32f4/clock.hpp's Rates<> + DynamicClock).
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE. The RTC's wake-up timer is the alarm, its calendar is
// the wall clock, the console is the board's own ST-LINK virtual COM
// port, and no flash is written and no option byte touched.
//
// THE WALL CLOCK IS THE RTC, AND IT HAS TO BE. Every TIM of this family
// lives in the 1.2 V domain and stops in Stop; SysTick rides HCLK and
// stops with it; the RTC does not. So this suite runs the calendar with
// the prescalers split the OTHER way from the chapter's advice -
// PREDIV_A 0 and PREDIV_S 32767, which puts ck_apre at the root's full
// rate and makes the sub-second counter a 30.5 us stopwatch that keeps
// counting with every clock in the chip stopped. The kernel's own
// millis() is the SUBJECT of half these letters and never the judge.
//
// THE CLOCK IS DYNAMIC, and that is a subject too: the suite's SysClock
// is a DynamicClock over a pack of rates from the board's own root down
// to the 16 MHz HSI, with the kernel ticker and the console among the
// users it rebases. Letter f walks it; letter d USES it, dropping to the
// HSI so that a Stop's wake can be weighed without the PLL's restart
// buried in the same number.
//
// THE BACKSTOP IS THE IWDG, armed once in main() at about 32 seconds and
// refreshed at the top of every letter and inside every long loop. It
// cannot be turned off again (RM0390 21.3), which is the point: a sleep
// with no wake behind it costs one reboot and a banner instead of a
// board that has to be re-flashed.
//
// What is exercised, letter by letter:
//   a  the block and the ladder: SLEEPDEEP and PDDS as the two-register
//      pair they are, the Stop's four price bits and their refusals,
//      `armed()` as a read of the silicon, and the four rungs of the
//      mapping this target chose - with Standby ENFORCED off the ladder
//   b  Sleep, the shallow rung: the tick keeps running and the idle hook
//      comes back on it
//   c  STOP: kernel time stands still for the whole sleep, measured on
//      the RTC - and the system clock comes back as the HSI with the PLL,
//      the HSE and over-drive gone, which the site's resume_clock() puts
//      right
//   d  the wake-up cost of each regulator variant, weighed at 16 MHz on
//      the HSI where no PLL restart hides inside it, against DS10693
//      table 36
//   e  the SYSCLK restore: how long it takes to get from a Stop's HSI
//      back to the board's top rate, and that it works with the
//      peripheral clocks the manual's boot recipe would have had off
//   f  the DynamicClock ladder walked up and down, every rate weighed
//      against the LSE and the console re-based at each step
//   g  a Stop through a REAL KERNEL: the vote round, a standing lock,
//      the deadline guard, the first-event-after-wake contract, and the
//      PLAIN site's honest restriction (an armed time event matures LATE
//      by the sleep)
//   h  THE TIMED SITE: the same deadline met on the wall, never early,
//      with the frozen span handed back to the ticker
//   i  the surface nothing on this board can stage: the PVD at every
//      threshold and its EXTI line, the wake-up pins and the one flag
//      they share, the backup regulator, and the DBGMCU bits AS FOUND
//
//   s  (by name only) STANDBY. The 1.2 V domain is powered off and the
//      wake comes back THROUGH THE RESET VECTOR, so this letter reboots
//      the board and resumes from an RTC backup register - which is what
//      a program without SRAM has to do. Not in `z`. Run it with
//          brio run <board> s --app test_stm32f4_power
//                  --expect="pass," --timeout 60
//
// build: boards = f429zi,f446re,f411ce
// build: monitor_speed = 115200

#include <stdint.h>

#include "kernel/post.hpp"
#include "kernel/tenuto.hpp"
#include "kernel/time_event.hpp"
#include "stm32f4/clock.hpp"
#include "stm32f4/exti.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/pwr.hpp"
#include "stm32f4/reset.hpp"
#include "stm32f4/rtc.hpp"
#include "stm32f4/sleep.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/power.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

namespace {

using namespace brio;

using P = Stm32f4Platform<>;

#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#else
using Led = Pin<'A', 5>;
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
#endif

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

// ---------------------------------------------------------------------------
// The rate pack: the board's top rate first (the boot rate), the 16 MHz
// HSI last. Every rate is a TUPLE - root, PLL ratio, regulator scale,
// over-drive, flash latency, both APB prescalers - and naming the rate
// names all six.
// ---------------------------------------------------------------------------
#if defined(STM32F411xE)
using R0 = Clock<ClockSource::pll_hse, 100'000'000, 25'000'000>;
using R1 = Clock<ClockSource::pll_hse, 84'000'000, 25'000'000>;
using R2 = Clock<ClockSource::pll_hse, 48'000'000, 25'000'000>;
using R3 = Clock<ClockSource::hsi, 16'000'000>;
using RatePack = Rates<R0, R1, R2, R3>;
#elif defined(STM32F429xx)
using R0 = Clock<ClockSource::pll_hse, 180'000'000, 8'000'000>;
using R1 = Clock<ClockSource::pll_hse, 168'000'000, 8'000'000>;
using R2 = Clock<ClockSource::pll_hse, 120'000'000, 8'000'000>;
using R3 = Clock<ClockSource::pll_hse, 84'000'000, 8'000'000>;
using R4 = Clock<ClockSource::pll_hse, 48'000'000, 8'000'000>;
using R5 = Clock<ClockSource::hsi, 16'000'000>;
using RatePack = Rates<R0, R1, R2, R3, R4, R5>;
#else
using R0 = Clock<ClockSource::pll_hse, 180'000'000, 8'000'000, HseMode::bypass>;
using R1 = Clock<ClockSource::pll_hse, 168'000'000, 8'000'000, HseMode::bypass>;
using R2 = Clock<ClockSource::pll_hse, 120'000'000, 8'000'000, HseMode::bypass>;
using R3 = Clock<ClockSource::pll_hse, 84'000'000, 8'000'000, HseMode::bypass>;
using R4 = Clock<ClockSource::pll_hse, 48'000'000, 8'000'000, HseMode::bypass>;
using R5 = Clock<ClockSource::hsi, 16'000'000>;
using RatePack = Rates<R0, R1, R2, R3, R4, R5>;
#endif

using SysClock = DynamicClock<RatePack, Ticker, Serial>;
constexpr SysClock clock;

constexpr uint8_t hsi_rate_index = SysClock::rate_count - 1u;

// ---------------------------------------------------------------------------
// The RTC as the wall clock and as the alarm
// ---------------------------------------------------------------------------
//
// The board with a crystal runs the calendar on it; the one without runs
// it on the LSI, an RC oscillator the datasheet only bounds - so the
// STATED rate there is deliberately the top of that bound, which is the
// direction the timed site's contract wants (late, never early) and the
// direction that makes every microsecond printed here a lower bound.

