uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
#if defined(STM32F429xx)
constexpr RtcClockSource rtc_source = RtcClockSource::lsi;
constexpr uint32_t stated_rtcclk_hz = 47'000;   // DS10693's LSI upper bound
#else
constexpr RtcClockSource rtc_source = RtcClockSource::lse;
constexpr uint32_t stated_rtcclk_hz = 32'768;
#endif

constexpr TimedSleepConfig timed_cfg{.rtcclk_hz = stated_rtcclk_hz,
                                     .source = rtc_source,
                                     .wipe_domain = true,
                                     .fast_clock = RtcWakeupClock::div16};

using Site = Stm32f4SleepSite<SysClock>;
using TimedSite = Stm32f4TimedSleepSite<P, SysClock, timed_cfg>;

TestBench<Serial> bench;

/// True while the RTC_WKUP vector belongs to the timed site; false while
/// a letter drives the wake-up timer itself.
volatile bool site_owns_wakeup = false;
volatile uint16_t wakeup_count = 0;

/// What RTCCLK really is, in hertz - WEIGHED, not stated: the crystal is
/// 32768 within its tens of ppm, but the LSI is an RC oscillator the
/// datasheet only bounds (17..47 kHz), and a wall read in its ticks is
/// worth nothing until the ticks have been counted against the core's
/// own clock. weigh_wall() does that once, the first time a letter asks
/// whether the wall is up; until then the stated rate stands (the site's
/// contract keeps the STATED rate on purpose: late, never early).
uint32_t rtcclk_hz = stated_rtcclk_hz;
bool wall_weighed = false;
/// A crystal is trusted at its stated rate (tens of ppm, below what a
/// millisecond ruler can add); the LSI is weighed.
constexpr bool wall_is_crystal = rtc_source == RtcClockSource::lse;

/// How many sub-second ticks make one CALENDAR second: PREDIV_S + 1,
/// whatever split is in force (the timed site owns the split, and a
/// helper that had baked it in would report nonsense after letter h).
uint32_t wall_ticks_per_second() {
    return static_cast<uint32_t>(Rtc::prescalers().sync) + 1u;
}
uint32_t wall_modulus() { return 60u * wall_ticks_per_second(); }

/// What one sub-second tick is worth in real time: ck_apre, which is
/// RTCCLK over PREDIV_A + 1.
uint32_t wall_hz() {
    return rtcclk_hz / (static_cast<uint32_t>(Rtc::prescalers().async) + 1u);
}

/// Sub-second ticks since the top of the minute, or 0xFFFFFFFF when the
/// calendar could not be read coherently.
uint32_t wall() {
    RtcReading r{};
    if (!Rtc::read(r)) {
        return 0xFFFFFFFFu;
    }
    const uint32_t per = wall_ticks_per_second();
    return static_cast<uint32_t>(r.time.second) * per + (per - 1u - r.subsecond);
}

uint32_t wall_delta(uint32_t from, uint32_t to) {
    return (to >= from) ? (to - from) : (wall_modulus() - from + to);
}
uint32_t wall_us(uint32_t ticks) {
    return static_cast<uint32_t>((static_cast<uint64_t>(ticks) * 1'000'000ULL) / wall_hz());
}
uint32_t wall_ms(uint32_t ticks) { return wall_us(ticks) / 1000u; }

/// Count the sub-second ticks over a quarter of a second of kernel tick
/// (the ticker rides the core clock, HSE-derived: the ruler) and derive
/// RTCCLK from them through the prescaler in force.
void weigh_wall() {
    if (wall_is_crystal) {
        wall_weighed = true;
        return;
    }
    // Both ends on a sub-second tick EDGE, so the wall's own granularity
    // (one ck_apre tick, 4 ms at the reset prescalers) drops out and what
    // remains is the millisecond ruler's edge over two seconds: 500 ppm.
    auto edge = [] {
        const uint32_t w = wall();
        uint32_t spins = 2'000'000u;
        while (wall() == w && spins-- != 0u) {
        }
        return wall();
    };
    const uint32_t w0 = edge();
    const uint32_t k0 = Ticker::millis();
    while (Ticker::millis() - k0 < 2000u) {
    }
    const uint32_t w1 = edge();
    const uint32_t k1 = Ticker::millis();
    if (w0 == 0xFFFFFFFFu || w1 == 0xFFFFFFFFu || k1 == k0) {
        return;
    }
    const uint32_t apre_hz =
        static_cast<uint32_t>((static_cast<uint64_t>(wall_delta(w0, w1)) * 1000ULL) / (k1 - k0));
    rtcclk_hz = apre_hz * (static_cast<uint32_t>(Rtc::prescalers().async) + 1u);
    wall_weighed = true;
    print(serial, "  RTCCLK weighed against the core: ", rtcclk_hz, " Hz (", stated_rtcclk_hz,
          " stated - the LSI's bound, which the timed site keeps on purpose)", crlf);
}

/// True when the wall can be read at all - every measuring letter asks
/// first rather than printing a number taken from a stopped counter - and
/// the first time it can, it is weighed.
bool wall_up() {
    if (wall() == 0xFFFFFFFFu) {
        return false;
    }
    if (!wall_weighed) {
        weigh_wall();
    }
    return true;
}

bool within(uint32_t v, uint32_t lo, uint32_t hi) { return v >= lo && v <= hi; }

/// Spin to the next kernel-tick boundary. A deadline of N ticks matures
/// at the N-th BOUNDARY after it is armed, so arming it mid-tick makes
/// the wall span up to one millisecond short of N - a property of a
/// 1 kHz tick and not of any sleep. Every wall-judged deadline in this
/// suite is armed from a boundary, which takes that millisecond out of
/// the measurement instead of out of the verdict.
void at_tick_edge() {
    const uint32_t t = Ticker::ticks();
    while (Ticker::ticks() == t) {
    }
}

// ---------------------------------------------------------------------------
// The watchdog backstop and the console
// ---------------------------------------------------------------------------
bool feed_iwdg = false;
void feed() {
    if (feed_iwdg) {
        Iwdg::refresh();
    }
}

/// Wait for the console to be physically empty. Called before anything
/// that is measured on the wall: a line of verdict is four milliseconds
/// at 115200, and a drain placed inside a measurement is the measurement.
///
/// AND THE RING BEING EMPTY IS NOT THE WIRE BEING EMPTY. `tx_idle()` says
/// the transport has nothing left to hand the USART; the last character
/// is then still in the shift register, and a Stop taken at that instant
/// kills PCLK1 in the middle of it. Measured: the line's own CRLF lost
/// and the host resynchronizing several bytes into the next line. TC is
/// the wire's own flag, and this is the only place in the suite that
/// reaches past the transport for it.
void console_drain() {
    for (uint32_t i = 0; i < 20'000'000u && !Serial::tx_idle(); ++i) {
    }
    for (uint32_t i = 0;
         i < 2'000'000u && (Usart<console_instance>::status() & UsartFlag::tc) == 0u; ++i) {
    }
}

/// The three DBGMCU bits at the very first instruction of main(), before
/// anything took them down. A probe leaves them set and they survive
/// every reset but a power-on, so what a Stop does on this board depends
/// on what somebody else left there.
bool dbg_sleep_at_boot = false;
bool dbg_stop_at_boot = false;
bool dbg_standby_at_boot = false;
/// And PWR_CSR's two flags, likewise: SBF and WUF outlive a system reset.
bool sbf_at_boot = false;
bool wuf_at_boot = false;
uint32_t reset_flags_at_boot = 0;

/// True while a Tenuto is the thing being pumped: the RTC handler posts
/// the wake into it only then (letters g and h), and never while a letter
/// is driving the wake-up timer by hand.
volatile bool kernel_running = false;

