uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
// =============================================================================
// a - the block and the ladder
// =============================================================================
void ta_block() {
    feed();
    print(serial, "  PWR_CR ", hex(Pwr::cr()), "  PWR_CSR ", hex(Pwr::csr()),
          "  VOS scale ", static_cast<uint32_t>(Pwr::scale()),
          Pwr::scale_ready() ? " (ready)" : " (not ready)",
          Pwr::over_drive_active() ? ", over-drive ACTIVE" : ", no over-drive", crlf);
    bench.verdict("the block answers through its APB1 gate", Pwr::bus_clock());

    // ---- SLEEPDEEP and PDDS as one pair ------------------------------------
    (void)Pwr::arm(PwrMode::sleep);
    bench.verdict("arm(sleep) is SLEEPDEEP clear, whatever PDDS holds",
                  !Pwr::deep_sleep() && Pwr::mode() == PwrMode::sleep);
    (void)Pwr::arm(PwrMode::stop);
    bench.verdict("arm(stop) is SLEEPDEEP set and PDDS clear",
                  Pwr::deep_sleep() && !Pwr::power_down_deep_sleep() &&
                      Pwr::mode() == PwrMode::stop);
    (void)Pwr::arm(PwrMode::standby);
    bench.verdict("arm(standby) is both", Pwr::deep_sleep() &&
                                              Pwr::power_down_deep_sleep() &&
                                              Pwr::mode() == PwrMode::standby);
    Pwr::power_down_deep_sleep(false);
    (void)Pwr::arm(PwrMode::sleep);
    bench.verdict("and mode() is a pure read of the two registers, not a mirror",
                  Pwr::mode() == PwrMode::sleep);

    // ---- the four price bits ------------------------------------------------
    bench.verdict("the plain Stop configuration is written and read back",
                  Pwr::stop_config(StopConfig{}) &&
                      Pwr::stop_config().regulator == StopRegulator::main &&
                      !Pwr::stop_config().flash_power_down);
    const StopConfig lp{StopRegulator::low_power, true, false, false};
    bench.verdict("the low-power regulator with the flash in power-down too",
                  Pwr::stop_config(lp) &&
                      Pwr::stop_config().regulator == StopRegulator::low_power &&
                      Pwr::stop_config().flash_power_down);
    const StopConfig lv{StopRegulator::low_power, true, true, false};
    const bool lv_ok = Pwr::stop_config(lv);
    print(serial, "  this part ", pwr_has_low_voltage_stop() ? "has" : "has NO",
          " the low-voltage pair and ", pwr_has_under_drive() ? "has" : "has NO",
          " the under-drive field; the FISSR/FMSSR pair is ",
          Pwr::has_flash_stop_while_run ? "present" : "absent", crlf);
    bench.verdict("the low-voltage mode is taken where the part has it and "
                  "refused where it has not",
                  lv_ok == pwr_has_low_voltage_stop() &&
                      (!lv_ok || Pwr::stop_config().low_voltage));
    bench.verdict("under-drive without the low-voltage mode it modifies is "
                  "refused everywhere (RM0390 table 17)",
                  !Pwr::stop_config(StopConfig{StopRegulator::main, true, false, true}));
    const StopConfig ud{StopRegulator::low_power, true, true, true};
    bench.verdict("and under-drive ON TOP of it is taken exactly where the "
                  "field exists",
                  Pwr::stop_config(ud) == pwr_has_under_drive());
    (void)Pwr::stop_config(StopConfig{});

    // ---- the site's mapping -------------------------------------------------
    bench.verdict("none maps to Sleep, and armed() says so",
                  Site::arm(SleepDepth::none) && Site::armed() == SleepDepth::none);
    bench.verdict("light maps to the SAME mode - between Sleep and Stop this "
                  "family has nothing",
                  Site::arm(SleepDepth::light) && Site::armed() == SleepDepth::none &&
                      Pwr::mode() == PwrMode::sleep);
    bench.verdict("standby maps to a Stop on the main regulator",
                  Site::arm(SleepDepth::standby) && Site::armed() == SleepDepth::standby &&
                      Pwr::mode() == PwrMode::stop &&
                      Pwr::stop_config().regulator == StopRegulator::main);
    bench.verdict("deep maps to a Stop on the low-power regulator with the "
                  "flash in power-down",
                  Site::arm(SleepDepth::deep) && Site::armed() == SleepDepth::deep &&
                      Pwr::mode() == PwrMode::stop &&
                      Pwr::stop_config().regulator == StopRegulator::low_power &&
                      Pwr::stop_config().flash_power_down);

    // ---- Standby is off the ladder, and the site takes PDDS down -----------
    Pwr::power_down_deep_sleep(true);
    const bool pdds_before = Pwr::power_down_deep_sleep();
    const bool armed_deep = Site::arm(SleepDepth::deep);
    bench.verdict("no rung reaches Standby: a PDDS left standing by anything "
                  "else is CLEARED by the next arm()",
                  pdds_before && armed_deep && !Pwr::power_down_deep_sleep());
    Site::disarm();
    bench.verdict("disarm() puts the shallow mode back", Site::armed() == SleepDepth::none &&
                                                             Pwr::mode() == PwrMode::sleep);

    // ---- the wake-up pins ---------------------------------------------------
    print(serial, "  wake-up pins bonded: ", static_cast<uint32_t>(Pwr::wakeup_pin_count));
    for (uint8_t n = 1; n <= 3u; ++n) {
        const PwrWakeupPad pad = Pwr::wakeup_pad(n);
        if (pad.known) {
            print(serial, "  WKUP", static_cast<uint32_t>(n), " = P",
                  static_cast<char>(pad.port), static_cast<uint32_t>(pad.pin));
        }
    }
    print(serial, crlf);
    bench.verdict("WKUP1 is PA0 and pin 1 exists on every part",
                  Pwr::wakeup_pin_present(1) && Pwr::wakeup_pad(1).known &&
                      Pwr::wakeup_pad(1).port == 'A' && Pwr::wakeup_pad(1).pin == 0);
    bench.verdict("a pin this part does not bond is refused, not written",
                  Pwr::wakeup_pin_present(4) == false && !Pwr::wakeup_pin(4, true));
}

