uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
// =============================================================================
// b - Sleep, the shallow rung
// =============================================================================
void tb_sleep() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    site_owns_wakeup = false;

    // The tick is the only wake: nothing else is armed, so a WFI here
    // lasts at most one millisecond.
    (void)Site::arm(SleepDepth::light);
    console_drain();
    const uint32_t k0 = Ticker::millis();
    const uint32_t w0 = wall();
    for (uint16_t i = 0; i < 100u; ++i) {
        Pwr::wait_for_interrupt();
    }
    const uint32_t w1 = wall();
    const uint32_t k1 = Ticker::millis();
    Site::disarm();

    const uint32_t wall_span = wall_ms(wall_delta(w0, w1));
    print(serial, "  100 WFIs in Sleep: ", k1 - k0, " ms of kernel tick, ", wall_span,
          " ms of wall", crlf);
    bench.verdict("Sleep keeps HCLK and SysTick: the tick counted the sleep",
                  within(k1 - k0, 95u, 110u));
    bench.verdict("and the wall agrees with it - nothing stood still",
                  within(wall_span, 95u, 110u));
    bench.verdict("the mode really was Sleep: SLEEPDEEP was never set",
                  !Pwr::deep_sleep());

    // The wake cost, differenced against a control that does not sleep.
    (void)Site::arm(SleepDepth::light);
    console_drain();
    const uint32_t a0 = wall();
    for (uint16_t i = 0; i < 200u; ++i) {
        Pwr::wait_for_interrupt();
    }
    const uint32_t a1 = wall();
    Site::disarm();
    print(serial, "  200 tick-woken sleeps took ", wall_us(wall_delta(a0, a1)),
          " us of wall (200 kernel ticks is 200000 us; the excess is the "
          "wake and the loop)", crlf);
    bench.verdict("a Sleep's wake is far below one tick - the sleeps did not "
                  "cost a tick between them",
                  within(wall_ms(wall_delta(a0, a1)), 195u, 215u));
}

// =============================================================================
// c - a Stop, the frozen tick and the clock that comes back
// =============================================================================
void tc_stop() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    site_owns_wakeup = false;
    wakeup_count = 0;
    Nvic::enable(Rtc::wakeup_irq());

    // 200 ms on the fast clock: RTCCLK / 16 counts. THE ALARM IS
    // PROGRAMMED AFTER THE WALL IS STAMPED, because the wake-up timer
    // starts counting the moment WUTE goes up - a console drain between
    // the two would be time the alarm had already spent (measured: five
    // milliseconds of it).
    const uint32_t fast_hz = rtcclk_hz / 16u;
    const uint32_t reload = (200u * fast_hz) / 1000u - 1u;

    console_drain();
    const uint32_t k0 = Ticker::millis();
    const uint32_t w0 = wall();
    const bool alarm = Rtc::set_wakeup(RtcWakeupClock::div16, reload, true);
    (void)Site::arm(SleepDepth::standby);   // a Stop on the main regulator
    Pwr::wait_for_interrupt();
    // NOTHING MAY BE PRINTED HERE: the core is on the HSI with the
    // console's divisor meant for the top rate. Everything is captured
    // and judged after the restore.
    const uint32_t w1 = wall();
    const SysclkSource after = Rcc::sysclk_status();
    const VoltageScale scale_after = Pwr::scale();
    const bool vosrdy_after = Pwr::scale_ready();
    const bool od_after = Pwr::over_drive_active();
    const bool pll_after = Rcc::pll_ready();
    const bool hse_after = Rcc::hse_ready();
    const uint32_t r0 = wall();
    Site::disarm();   // resume_clock() lives here
    const uint32_t r1 = wall();
    const uint32_t k1 = Ticker::millis();

    Rtc::clear_wakeup();
    Nvic::disable(Rtc::wakeup_irq());

    const uint32_t slept_ms = wall_ms(wall_delta(w0, w1));
    const uint32_t restore_us = wall_us(wall_delta(r0, r1));
    print(serial, "  the alarm was placed at reload ", reload, " on RTCCLK/16 (",
          fast_hz, " Hz); the Stop lasted ", slept_ms, " ms of wall and the kernel "
          "tick moved ", k1 - k0, " ms", crlf);
    print(serial, "  at the first instruction after the wake: SYSCLK ",
          after == SysclkSource::hsi ? "HSI" : (after == SysclkSource::pll ? "PLL" : "HSE"),
          ", the VOS field still reads scale ", static_cast<uint32_t>(scale_after),
          " (VOSRDY ", vosrdy_after ? "up" : "down", "), over-drive ", od_after ? "on" : "off",
          ", PLL ", pll_after ? "locked" : "off", ", HSE ", hse_after ? "ready" : "off",
          "; the restore took ", restore_us, " us", crlf);
    print(serial, "  DBG_STOP was ", dbg_stop_at_boot ? "SET" : "clear", " at boot and is ",
          Pwr::debug_in_stop() ? "SET" : "clear",
          " now - set, it would have kept HCLK alive through the Stop above", crlf);

    bench.verdict("the alarm was programmed", alarm);
    bench.verdict("the wake really came from the RTC", wakeup_count >= 1u);
    bench.verdict("the Stop lasted what the alarm asked for, on the wall",
                  within(slept_ms, 195u, 215u));
    bench.verdict("KERNEL TIME STOOD STILL for the whole of it - SysTick rides "
                  "HCLK and HCLK stopped",
                  (k1 - k0) < 10u);
    bench.verdict("the core came back ON THE HSI, as 5.3.5 says", after == SysclkSource::hsi);
    bench.verdict("with the PLL and the HSE off", !pll_after && !hse_after);
    bench.verdict("over-drive is CLEARED BY HARDWARE on the way out (5.4.1: "
                  "ODEN and ODSWEN are 'cleared automatically by hardware after "
                  "exiting from Stop mode')",
                  !od_after);
    bench.verdict("but the VOS FIELD is not touched: 5.1.3 forces the "
                  "regulator's ACTIVE scale to 3 while the PLL is off and "
                  "leaves the programmed value where it was",
                  scale_after == SysClock::rate_regime(SysClock::rate_index()).scale);
    bench.verdict("the site's disarm() put the whole tree back",
                  Rcc::sysclk_status() == SysClock::rate_source(SysClock::rate_index()));
}

