uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
// =============================================================================
// d - the regulator variants, weighed where no PLL restart hides
// =============================================================================
struct Variant {
    const char* name;
    StopConfig cfg;
    bool present;
    uint32_t typ_us;   ///< DS10693 table 36's typical, for comparison only
};

void td_variants() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    site_owns_wakeup = false;
    Nvic::enable(Rtc::wakeup_irq());

    // THE MEASUREMENT IS MADE AT 16 MHz ON THE HSI, which is what makes
    // it a measurement of the WAKE and not of the PLL: after a Stop the
    // core is on the HSI already, so resume_clock() has nothing to do and
    // the only thing between two laps is the alarm, the wake and a
    // handful of instructions.
    const uint8_t was = SysClock::rate_index();
    const bool down = SysClock::set_index(hsi_rate_index);
    console_drain();

    const uint32_t fast_hz = rtcclk_hz / 16u;
    const uint32_t reload = (4u * fast_hz) / 1000u;   // about 4 ms a lap
    constexpr uint16_t laps = 32;

    const Variant variants[] = {
        {"MR", StopConfig{StopRegulator::main, false, false, false}, true, 13},
        {"LP", StopConfig{StopRegulator::low_power, false, false, false}, true, 21},
        {"MR + FPDS", StopConfig{StopRegulator::main, true, false, false}, true, 105},
        {"LP + FPDS", StopConfig{StopRegulator::low_power, true, false, false}, true, 113},
        {"LP + FPDS + low voltage",
         StopConfig{StopRegulator::low_power, true, true, false}, pwr_has_low_voltage_stop(), 0},
        {"LP + FPDS + under-drive",
         StopConfig{StopRegulator::low_power, true, true, true}, pwr_has_under_drive(), 114},
    };
    uint32_t lap_us[6] = {};
    bool measured[6] = {};

    for (uint8_t v = 0; v < 6u; ++v) {
        if (!variants[v].present) {
            continue;
        }
        feed();
        if (!Pwr::arm(PwrMode::stop, variants[v].cfg)) {
            continue;
        }
        Ticker::pause();
        const uint32_t w0 = wall();
        for (uint16_t i = 0; i < laps; ++i) {
            (void)Rtc::set_wakeup(RtcWakeupClock::div16, reload, true);
            Pwr::wait_for_interrupt();
        }
        const uint32_t w1 = wall();
        Ticker::resume();
        Rtc::clear_wakeup();
        (void)Pwr::arm(PwrMode::sleep);
        lap_us[v] = wall_us(wall_delta(w0, w1)) / laps;
        measured[v] = true;
    }

    const bool back = SysClock::set_index(was);
    Nvic::disable(Rtc::wakeup_irq());

    const uint32_t alarm_us = ((reload + 1u) * 1'000'000u) / fast_hz;
    print(serial, "  ", laps, " Stops a variant at 16 MHz on the HSI, the alarm ",
          alarm_us, " us apart; each lap is that plus the wake and the "
          "arming code", crlf);
    for (uint8_t v = 0; v < 6u; ++v) {
        if (!measured[v]) {
            print(serial, "  ", variants[v].name, ": absent on this part", crlf);
            continue;
        }
        print(serial, "  ", variants[v].name, ": ", lap_us[v], " us a lap, ",
              lap_us[v] > lap_us[0] ? lap_us[v] - lap_us[0] : 0u,
              " us more than the main regulator");
        if (variants[v].typ_us != 0u) {
            print(serial, " (DS10693 table 36 puts the two ",
                  variants[v].typ_us > variants[0].typ_us
                      ? variants[v].typ_us - variants[0].typ_us
                      : 0u,
                  " us apart, typical)");
        }
        print(serial, crlf);
    }

    bench.verdict("the ladder walked down to the HSI and back for the "
                  "measurement",
                  down && back && SysClock::rate_index() == was);
    bench.verdict("every variant this part has took a real Stop",
                  measured[0] && measured[1] && measured[2] && measured[3]);
    // DS10693 table 36 puts the low-power regulator eight microseconds
    // above the main one, TYPICAL - and eight microseconds is the one
    // step of this table that did not show above the HSI's own startup
    // here (the numbers are printed; the doc says what was seen). So the
    // verdict is the direction and not the size: a deeper variant is
    // never CHEAPER to leave.
    // Two microseconds of slack: where the two laps are equal (the
    // STM32F411 shows no step at all) the alarm's own jitter decides the
    // sign of a one-microsecond difference.
    bench.verdict("the low-power regulator is never cheaper to leave than the "
                  "main one",
                  lap_us[1] + 2u >= lap_us[0]);
    // The flash's own wake is the big step on one part (92 us measured
    // against DS10693's 92 typical on the STM32F446) and no step at all on
    // another (the STM32F411 leaves every variant at the same lap) - a fact
    // of the part, printed above and judged only in its direction.
    print(serial, "  the flash in power-down costs ", lap_us[2] - lap_us[1],
          " us more than the regulator alone on this part", crlf);
    bench.verdict("and the flash in power-down is never cheaper to leave than the "
                  "regulator alone",
                  lap_us[2] >= lap_us[1] && lap_us[3] >= lap_us[1]);
    if (measured[5]) {
        bench.verdict("under-drive is the deepest and the slowest to leave",
                      lap_us[5] >= lap_us[3]);
        bench.verdict("and PWR_CSR.UDRDY records that the device really entered it",
                      Pwr::under_drive_flag());
        Pwr::clear_under_drive_flag();
    }
}

// =============================================================================
// e - the SYSCLK restore
// =============================================================================
void te_restore() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    site_owns_wakeup = false;
    Nvic::enable(Rtc::wakeup_irq());

    const uint32_t fast_hz = rtcclk_hz / 16u;
    const uint32_t reload = (4u * fast_hz) / 1000u;
    constexpr uint16_t laps = 16;

    // Each lap: a real Stop (which parks the tree on the HSI, stops the
    // PLL and the HSE and drops the regulator to scale 3), then the
    // restore, bracketed on the wall. The two wall reads happen at
    // 16 MHz and cost a few microseconds of the number printed.
    (void)Site::arm(SleepDepth::standby);
    Ticker::pause();
    console_drain();
    uint32_t total = 0;
    uint32_t worst = 0;
    uint16_t restored = 0;
    for (uint16_t i = 0; i < laps; ++i) {
        (void)Rtc::set_wakeup(RtcWakeupClock::div16, reload, true);
        Pwr::wait_for_interrupt();
        const uint32_t a = wall();
        if (Site::resume_clock()) {
            ++restored;
        }
        const uint32_t b = wall();
        const uint32_t us = wall_us(wall_delta(a, b));
        total += us;
        if (us > worst) {
            worst = us;
        }
        (void)Pwr::arm(PwrMode::stop, StopConfig{});
    }
    Ticker::resume();
    Rtc::clear_wakeup();
    Site::disarm();
    Nvic::disable(Rtc::wakeup_irq());

