uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
    print(serial, "  ", laps, " restores from a real Stop back to ", SysClock::hz(),
          " Hz: ", total / laps, " us each on average, ", worst, " us at worst", crlf);
    print(serial, "  the tree is now SYSCLK ", SysClock::hz(), " Hz, PCLK1 ",
          SysClock::pclk1_hz(), " Hz, PCLK2 ", SysClock::pclk2_hz(), " Hz, scale ",
          static_cast<uint32_t>(Pwr::scale()), ", over-drive ",
          Pwr::over_drive_active() ? "on" : "off", ", ",
          static_cast<uint32_t>(FlashWaitStates::get()), " wait states", crlf);

    bench.verdict("the restore put the root back", Rcc::sysclk_status() ==
                                                       SysClock::rate_source(SysClock::rate_index()));
    bench.verdict("with the regulator at the scale the rate needs and its "
                  "VOSRDY up",
                  Pwr::scale() == SysClock::rate_regime(SysClock::rate_index()).scale &&
                      Pwr::scale_ready());
    bench.verdict("and over-drive where the rate needs it",
                  Pwr::over_drive_active() ==
                      SysClock::rate_regime(SysClock::rate_index()).over_drive);
    bench.verdict("the flash latency is the rate's own",
                  FlashWaitStates::get() ==
                      SysClock::rate_wait_states(SysClock::rate_index()));
    // The manual's boot recipe wants no peripheral clock enabled during
    // the over-drive switch (5.1.4's note: "during the Over-drive switch
    // activation, no peripheral clocks should be enabled"). A restore
    // cannot honour that - the console, the RTC and the PWR block are all
    // clocked when it runs - so sixteen of them in a row, each reporting
    // its own success, is what says the note is a boot recipe and not a
    // condition of the switch.
    bench.verdict("every one of the restores reported success, WITH the "
                  "peripheral clocks the manual's boot recipe would have had "
                  "off - the console among them",
                  restored == laps && total > 0u && worst < 100'000u);
}

// =============================================================================
// f - the DynamicClock ladder, up and down
// =============================================================================
uint32_t weigh_rate() {
    // 100 kernel ticks against the wall. The reload is hz / 1000 exactly
    // for every rate in the pack, so 100 ticks IS 100 ms if HCLK is what
    // the rate says - and the LSE is what says otherwise.
    const uint32_t k0 = Ticker::ticks();
    while (Ticker::ticks() == k0) {
    }
    const uint32_t w0 = wall();
    const uint32_t k1 = Ticker::ticks();
    while (Ticker::ticks() - k1 < 100u) {
    }
    const uint32_t w1 = wall();
    return wall_us(wall_delta(w0, w1));
}

void tf_ladder() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    const uint8_t start = SysClock::rate_index();
    bool every_rate_ran = true;
    bool every_bus_in_range = true;
    bool worst_ppm_ok = true;
    uint32_t up_us = 0;
    uint32_t down_us = 0;

    constexpr SysclkLadder ladder = sysclk_ladder();

    // Down the pack (the pack is ordered top rate first), then up again.
    for (uint8_t i = 0; i < SysClock::rate_count; ++i) {
        feed();
        console_drain();
        const uint32_t s0 = wall();
        const bool ok = SysClock::set_index(i);
        const uint32_t s1 = wall();
        down_us += wall_us(wall_delta(s0, s1));
        const uint32_t measured = weigh_rate();
        const uint32_t want = 100'000u;
        const int32_t err = static_cast<int32_t>(measured) - static_cast<int32_t>(want);
        const uint32_t ppm = static_cast<uint32_t>(err < 0 ? -err : err) * 10u;
        const bool hsi_rooted = SysClock::rate_source(i) == SysclkSource::hsi;
        print(serial, "  rate ", static_cast<uint32_t>(i), ": ", SysClock::hz(),
              " Hz (PCLK1 ", SysClock::pclk1_hz(), ", PCLK2 ", SysClock::pclk2_hz(),
              ", ", static_cast<uint32_t>(FlashWaitStates::get()), " WS, scale ",
              static_cast<uint32_t>(Pwr::scale()), Pwr::over_drive_active() ? " +OD" : "",
              ") - 100 ticks measured ", measured, " us on the wall, ", ppm,
              " ppm ", err < 0 ? "fast" : "slow", crlf);
        if (!ok || SysClock::rate_index() != i || SysClock::hz() != SysClock::rate_hz(i)) {
            every_rate_ran = false;
        }
        if (ladder.known && (SysClock::pclk1_hz() > ladder.apb1_max_hz ||
                             SysClock::pclk2_hz() > ladder.apb2_max_hz)) {
            every_bus_in_range = false;
        }
        // A loose band: it catches a rate that is WRONG (a missed PLL, a
        // stale prescaler) and says nothing about this crystal's own
        // accuracy. The HSI is an RC oscillator and gets the wider one.
        if (ppm > (hsi_rooted ? 40'000u : 5'000u)) {
            worst_ppm_ok = false;
        }
    }
    for (uint8_t i = SysClock::rate_count; i > 0u; --i) {
        feed();
        console_drain();
        const uint32_t s0 = wall();
        const bool ok = SysClock::set_index(static_cast<uint8_t>(i - 1u));
        const uint32_t s1 = wall();
        up_us += wall_us(wall_delta(s0, s1));
        if (!ok) {
            every_rate_ran = false;
        }
    }
    (void)SysClock::set_index(start);
    console_drain();

    print(serial, "  ", static_cast<uint32_t>(SysClock::rate_count),
          " rates walked down and up: ", down_us / SysClock::rate_count,
          " us a switch downward, ", up_us / SysClock::rate_count,
          " us upward (both include the park on the HSI, which every switch "
          "of this family makes)", crlf);

    bench.verdict("every rate of the pack came up and reported itself",
                  every_rate_ran);
    bench.verdict("every rate's tick agreed with the wall - the PLL, the "
                  "prescalers and the ticker's reload all followed",
                  worst_ppm_ok);
    bench.verdict("and no APB was ever left above its ceiling",
                  every_bus_in_range);
    bench.verdict("the console and the ticker are among the users the pack "
                  "rebases - which is why these lines are legible at every "
                  "rate, and why a driver forgotten in the list would not "
                  "compile",
                  clock_follows<SysClock, Serial>() && clock_follows<SysClock, Ticker>());
    bench.verdict("the ladder ended where it started",
                  SysClock::rate_index() == start && SysClock::hz() == SysClock::rate_hz(start));

    // The rate a program NAMES rather than indexes.
    bench.verdict("set(hz) finds a rate by its number",
                  SysClock::set(SysClock::rate_hz(start)) &&
                      SysClock::rate_index() == start);
    bench.verdict("and a rate the pack does not name is refused with nothing "
                  "changed",
                  !SysClock::set(37u) && SysClock::rate_index() == start);
}

