uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
// =============================================================================
// g and h - a Stop through a real kernel
// =============================================================================
struct Blip {};
struct Woke {};   ///< posted by the RTC handler on a plain-site wake

bool timed_round = false;

struct Probe : Fsm<Probe, SleepVote, PrepareSleep, WakeReport, Blip, Woke> {
    static inline EventQueue<Event, 8, P> queue;
    static inline TimeEvent<P, Probe, Blip> deadline{Blip{}};

    static inline uint16_t blips = 0;
    static inline uint16_t woke = 0;
    static inline uint16_t wakes = 0;
    static inline uint16_t votes = 0;
    static inline uint16_t asked = 0;
    static inline bool last_ok = false;
    static inline bool refuse = false;
    static inline uint32_t blip_wall = 0;
    static inline SleepDepth last_report = SleepDepth::none;
    static inline SleepDepth last_asked = SleepDepth::none;

    static void clear() {
        blips = woke = wakes = votes = asked = 0;
        last_ok = false;
        refuse = false;
        blip_wall = 0;
        last_report = SleepDepth::none;
        last_asked = SleepDepth::none;
    }

    static void init() { start(&only); }
    static Status only(const Event& e);
};

using PlainManager = PowerManager<P, Site, PowerConfig{}, Probe>;
using TimedManager = PowerManager<P, TimedSite, PowerConfig{}, Probe>;
using PlainKernel = Tenuto<P, Probe, PlainManager>;
using TimedKernel = Tenuto<P, Probe, TimedManager>;

void answer_manager() {
    if (timed_round) {
        post<TimedManager>(SleepRequested{SleepDepth::none, reply_to<Probe, SleepVote>()});
    } else {
        post<PlainManager>(SleepRequested{SleepDepth::none, reply_to<Probe, SleepVote>()});
    }
}

Probe::Status Probe::only(const Event& e) {
    return match(e,
        [](Entry) { return handled(); },
        [](Exit) { return handled(); },
        [](SleepVote v) {
            ++votes;
            last_ok = v.ok;
            return handled();
        },
        [](const PrepareSleep& p) {
            ++asked;
            last_asked = p.depth;
            p.reply.send(SleepVote{!refuse});
            return handled();
        },
        [](WakeReport w) {
            ++wakes;
            last_report = w.was;
            return handled();
        },
        [](Woke) {
            // THE MODEL'S CONVENTION, and with a Stop it is LOAD-BEARING:
            // a wake path with nothing to say says it with
            // SleepRequested{none}. Without it the manager never learns
            // the machine came back, the site is never disarmed, and on
            // this target that means the clock stays at 16 MHz and the
            // KERNEL'S TICK STAYS PAUSED - so nothing matures, ever.
            ++woke;
            answer_manager();
            return handled();
        },
        [](Blip) {
            ++blips;
            blip_wall = wall();
            answer_manager();
            return handled();
        });
}

template <class K>
void pump_until_blip(uint32_t guard_ms) {
    const uint32_t t0 = wall();
    while (Probe::blips == 0u && wall_ms(wall_delta(t0, wall())) < guard_ms) {
        feed();
        TimeEvents<P>::process();
        if (!K::step()) {
            K::idle_if_empty();
        }
    }
    while (K::step()) {
    }
}

void tg_kernel_stop() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    site_owns_wakeup = false;
    timed_round = false;
    PlainKernel::init_all();
    Probe::clear();

    // ---- the vote, refused ---------------------------------------------------
    Probe::refuse = true;
    post<PlainManager>(SleepRequested{SleepDepth::deep, reply_to<Probe, SleepVote>()});
    for (uint8_t i = 0; i < 8u && PlainKernel::step(); ++i) {
    }
    const bool refused = Probe::asked == 1u && Probe::votes == 1u && !Probe::last_ok &&
                         Site::armed() == SleepDepth::none;
    bench.verdict("ONE not-ok ends the round: the site is not armed and the "
                  "requester is told",
                  refused);

    // ---- a standing lock clamps the depth -----------------------------------
    Probe::clear();
    {
        PowerLock lock = PlainManager::restrict(SleepDepth::light);
        post<PlainManager>(SleepRequested{SleepDepth::deep, reply_to<Probe, SleepVote>()});
        for (uint8_t i = 0; i < 8u && PlainKernel::step(); ++i) {
        }
        bench.verdict("a standing lock clamps a deep request to the rung it "
                      "names - the voter is asked for the CLAMPED depth",
                      Probe::last_asked == SleepDepth::light &&
                          Site::armed() == SleepDepth::none);
    }
    bench.verdict("and the ceiling is back when the lock dies",
                  PlainManager::ceiling() == SleepDepth::deep);

    // ---- the deadline guard --------------------------------------------------
    Probe::clear();
    PlainKernel::init_all();
    Probe::deadline.arm(1u);
    post<PlainManager>(SleepRequested{SleepDepth::deep, reply_to<Probe, SleepVote>()});
    for (uint8_t i = 0; i < 8u && PlainKernel::step(); ++i) {
    }
    const bool guarded = Probe::asked == 0u && !Probe::last_ok;
    Probe::deadline.disarm();
    bench.verdict("a deadline nearer than min_deep_ticks refuses a deep round "
                  "BEFORE anyone is asked",
                  guarded);

    // ---- the round, through a real Stop -------------------------------------
    PlainKernel::init_all();
    Probe::clear();
    kernel_running = true;
    Nvic::enable(Rtc::wakeup_irq());
    // The wake is the RTC's own, 250 ms out: the manager knows nothing
    // about it, which is the point - a deep sleep's wake source is the
    // application's business and the model never asks.
    const uint32_t fast_hz = rtcclk_hz / 16u;
    (void)Rtc::set_wakeup(RtcWakeupClock::div16, (250u * fast_hz) / 1000u - 1u, true);

    console_drain();
    const uint32_t w0 = wall();
    const uint32_t k0 = Ticker::millis();
    Probe::deadline.arm(500u);
    post<PlainManager>(SleepRequested{SleepDepth::deep, reply_to<Probe, SleepVote>()});
    pump_until_blip<PlainKernel>(3000u);
    kernel_running = false;
    Rtc::clear_wakeup();
    Nvic::disable(Rtc::wakeup_irq());

    const uint32_t to_blip = wall_ms(wall_delta(w0, Probe::blip_wall));
    const uint32_t kernel_ms = Ticker::millis() - k0;
    print(serial, "  the round: ", Probe::votes, " vote(s), ", Probe::wakes,
          " wake report(s) at depth ", static_cast<uint32_t>(Probe::last_report),
          "; a 500 ms event matured after ", to_blip, " ms of WALL and ", kernel_ms,
          " ms of kernel tick", crlf);

