uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
    bench.verdict("the vote round ran and the site was armed at the depth the "
                  "target really took",
                  Probe::votes >= 1u && Probe::last_ok && Probe::last_report == SleepDepth::deep);
    bench.verdict("the first event after the wake ended the round - nothing "
                  "polled, and the manager disarmed on its own",
                  Probe::woke >= 1u && Probe::wakes >= 1u && Site::armed() == SleepDepth::none);
    bench.verdict("the clock was put back by the same disarm: the console is "
                  "legible and the rate is the program's",
                  Rcc::sysclk_status() == SysClock::rate_source(SysClock::rate_index()));
    bench.verdict("the deadline was met in KERNEL time, which is all the "
                  "kernel promises",
                  Probe::blips == 1u && kernel_ms >= 500u);
    bench.verdict("BUT NOT ON THE WALL - with the plain site the sleep is time "
                  "the tick never counted, so the event matured LATE by about "
                  "the length of the Stop",
                  to_blip > 700u);
}

// =============================================================================
// h - the timed site: the same deadline, on the wall
// =============================================================================
void th_timed_site() {
    feed();
    if (!wall_up()) {
        bench.verdict("the wall clock reads", false);
        return;
    }
    site_owns_wakeup = true;
    timed_round = true;
    kernel_running = true;
    const bool up = TimedSite::ready() || TimedSite::init();
    print(serial, "  the timed site ", up ? "is up" : "REFUSED",
          "; its prescalers are A ", TimedSite::prescalers.async, " / S ",
          TimedSite::prescalers.sync, ", its fast alarm clock ", TimedSite::fast_hz,
          " Hz, and it reaches ", TimedSite::fast_span_ticks, " ticks on it", crlf);
    bench.verdict("the timed site comes up on the root this board runs the RTC on", up);
    if (!up) {
        kernel_running = false;
        site_owns_wakeup = false;
        timed_round = false;
        return;
    }
    // THE NVIC LINE IS THE SITE'S WAY OUT OF THE STOP, and 5.3.5 is
    // explicit that a WFI-entered Stop is left only by "all EXTI lines
    // configured in Interrupt mode (the corresponding EXTI Interrupt
    // vector must be enabled in the NVIC)". main() leaves the line
    // disabled so the letters that drive the timer by hand own it;
    // measured, a round entered without this line open never comes back
    // and the watchdog reboots the board.
    Nvic::enable(Rtc::wakeup_irq());
    print(serial, "  the site states ", timed_cfg.rtcclk_hz, " Hz for RTCCLK; the wall "
          "above is read on the same number, so a rate stated too high shows "
          "up as a wall that runs slow and never as an early event", crlf);

    // The alarm's arithmetic, checked before any sleep.
    TimedKernel::init_all();
    Probe::clear();
    Probe::deadline.arm(500u);
    const bool armed = TimedSite::arm(SleepDepth::deep);
    const uint32_t reload = TimedSite::last_reload();
    const bool fast = TimedSite::last_alarm_was_fast();
    TimedSite::disarm();
    Probe::deadline.disarm();
    const uint32_t want =
        (500u * TimedSite::fast_hz + P::ticks_per_second - 1u) / P::ticks_per_second - 1u;
    print(serial, "  a 500 ms deadline placed the alarm at reload ", reload, " on the ",
          fast ? "fast" : "one-second", " clock; the arithmetic says ", want, crlf);
    bench.verdict("the alarm lands where the stated arithmetic puts it",
                  armed && fast && reload == want);

    // NOTHING MAY BE PRINTED BETWEEN arm() AND disarm(). arm() pauses the
    // kernel's tick for a deep rung, so the frozen span the resync hands
    // back is the WHOLE armed window - and a verdict line is four
    // milliseconds of console.
    const bool no_deadline_armed = TimedSite::arm(SleepDepth::deep);
    const bool no_alarm = !TimedSite::alarm_armed();
    TimedSite::disarm();
    const uint32_t napless = TimedSite::last_advance();
    bench.verdict("a deadline-less round places no alarm at all",
                  no_deadline_armed && no_alarm);
    bench.verdict("and a round that never slept advances at most a tick", napless <= 1u);

    // ---- the round trip ------------------------------------------------------
    TimedKernel::init_all();
    Probe::clear();
    console_drain();
    at_tick_edge();
    const uint32_t w0 = wall();
    const uint32_t k0 = Ticker::millis();
    Probe::deadline.arm(500u);
    post<TimedManager>(SleepRequested{SleepDepth::deep, reply_to<Probe, SleepVote>()});
    pump_until_blip<TimedKernel>(3000u);
    const uint32_t to_blip = wall_ms(wall_delta(w0, Probe::blip_wall));
    const uint32_t kernel_ms = Ticker::millis() - k0;
    print(serial, "  a 500 ms event through a Stop matured after ", to_blip,
          " ms of wall (", kernel_ms, " ms of kernel tick); the resync put back ",
          TimedSite::last_advance(), " ticks", crlf);
    // On a crystal the band is 500..580 ms; on the LSI the site states the
    // oscillator's UPPER bound, so its alarm lands late by the LSI's own
    // margin (printed above) and the band is the contract's alone: late,
    // never early.
    bench.verdict(wall_is_crystal ? "THE EVENT MATURED THROUGH A STOP, on the wall"
                                  : "THE EVENT MATURED THROUGH A STOP (on the LSI's stated bound, late by its margin)",
                  Probe::blips == 1u && (wall_is_crystal ? within(to_blip, 500u, 580u) : to_blip >= 500u));
    bench.verdict("and NEVER EARLY - the lower bound is the kernel's own promise",
                  to_blip >= 500u);
    bench.verdict("the sleep was real: the resync handed back a frozen span of "
                  "hundreds of ticks",
                  TimedSite::last_advance() > 350u && TimedSite::last_advance() < 540u);
    bench.verdict("and the round closed by the convention",
                  Probe::wakes >= 1u && TimedSite::armed() == SleepDepth::none);

    // ---- never early, repeated ------------------------------------------------
    constexpr uint16_t repeats = 6;
    constexpr uint32_t nominal = 150;
    uint16_t on_time = 0;
    uint32_t worst_lo = 0xFFFFFFFFu;
    uint32_t worst_hi = 0;
    for (uint16_t i = 0; i < repeats; ++i) {
        feed();
        TimedKernel::init_all();
        Probe::clear();
        console_drain();
        at_tick_edge();
        const uint32_t a = wall();
        Probe::deadline.arm(nominal);
        post<TimedManager>(SleepRequested{SleepDepth::deep, reply_to<Probe, SleepVote>()});
        pump_until_blip<TimedKernel>(1000u);
        if (Probe::blips != 1u) {
            continue;
        }
        const uint32_t ms = wall_ms(wall_delta(a, Probe::blip_wall));
        if (ms < worst_lo) {
            worst_lo = ms;
        }
        if (ms > worst_hi) {
            worst_hi = ms;
        }
        if (wall_is_crystal ? within(ms, nominal, nominal + 30u) : ms >= nominal) {
            ++on_time;
        }
    }
    print(serial, "  ", repeats, " rounds of ", nominal, " ms through a Stop: wall spans ",
          worst_lo, "..", worst_hi, " ms", crlf);
    bench.verdict(wall_is_crystal ? "every one of six shorter rounds matured inside the band"
                                  : "every one of six shorter rounds matured, none early (the LSI's stated bound sets the lateness)",
                  on_time == repeats);
    bench.verdict("and not one of them was early", worst_lo >= nominal);

