uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
    kernel_running = false;
    site_owns_wakeup = false;
    timed_round = false;
    Nvic::disable(Rtc::wakeup_irq());
    (void)Site::arm(SleepDepth::none);
    Ticker::resume();
}

// =============================================================================
// i - the surface nothing on this board can stage
// =============================================================================
void ti_surface() {
    feed();
    // ---- the debugger's three bits, AS FOUND ---------------------------------
    print(serial, "  the debugger's bits at boot: DBG_SLEEP ",
          dbg_sleep_at_boot ? "SET" : "clear", ", DBG_STOP ",
          dbg_stop_at_boot ? "SET" : "clear", ", DBG_STANDBY ",
          dbg_standby_at_boot ? "SET" : "clear",
          " - the register survives every reset but a power-on, and a probe "
          "writes all three", crlf);
    Pwr::debug_low_power(true);
    const bool s1 = Pwr::debug_in_sleep();
    const bool t1 = Pwr::debug_in_stop();
    const bool b1 = Pwr::debug_in_standby();
    Pwr::debug_low_power(false);
    const bool s0 = Pwr::debug_in_sleep();
    const bool t0 = Pwr::debug_in_stop();
    const bool b0 = Pwr::debug_in_standby();
    const DeviceIdcode id = DeviceIdcode::read();
    print(serial, "  written as a set they read back ", s1 ? "1" : "0", t1 ? "1" : "0",
          b1 ? "1" : "0", " and cleared again ", s0 ? "1" : "0", t0 ? "1" : "0",
          b0 ? "1" : "0", " (SLEEP/STOP/STANDBY); DBGMCU_IDCODE beside them reads DEV ",
          hex(id.dev_id), " REV ", hex(id.rev_id), crlf);
    // WHAT THIS SUITE NEEDS is only that the three bits are DOWN while a
    // sleep is weighed - letter c's frozen tick is the proof that they were.
    // Whether a write here puts them back or takes them down again is a
    // property of the debug power domain and of the probe attached (a
    // detached ST-LINK/V2 leaves later writes dead, an attached STLINK-V3
    // lets a set through and holds a clear), so it is printed, not judged.
    print(serial, "  after the clear the bits read ", (s0 || t0 || b0) ? "SET" : "clear",
          " - the sleeps below say whether the clocks stopped", crlf);

    // ---- the PVD -------------------------------------------------------------
    print(serial, "  the PVD's thresholds ", Pwr::pvd_levels_known ? "are known" : "are NOT known",
          " on this part class:");
    for (uint8_t code = 0; code < 8u; ++code) {
        print(serial, " ", Pwr::pvd_level_mv(code));
    }
    print(serial, " mV", crlf);
    bool any_below = false;
    for (uint8_t code = 0; code < 8u; ++code) {
        (void)Pwr::pvd_level(code);
        Pwr::pvd_enable(true);
        for (uint16_t i = 0; i < 2000u; ++i) {
        }
        if (Pwr::pvd_below()) {
            any_below = true;
        }
    }
    bench.verdict("the detector takes every one of its eight codes back",
                  Pwr::pvd_level(7) && Pwr::pvd_level() == 7u && !Pwr::pvd_level(8));
    bench.verdict("and at this board's supply it never reports VDD below a "
                  "threshold - the highest is 2.9 V",
                  !any_below);
    Pwr::pvd_enable(false);
    bench.verdict("PVDO is only valid while PVDE stands (5.4.2)", !Pwr::pvd_enabled());

    // The PVD's line is a CONFIGURABLE EXTI line, so it can be proved
    // without a supply change: the software trigger is the wire this
    // board has not got.
    const uint8_t line = Pwr::pvd_exti_line;
    bench.verdict("the PVD's line exists on this part", Exti::implemented(line));
    (void)Exti::sense(line, ExtiSense::rising);
    (void)Exti::interrupt(line, true);
    (void)Exti::clear(line);
    const bool quiet = !Exti::pending(line);
    (void)Exti::trigger(line);
    const bool fired = Exti::pending(line);
    (void)Exti::clear(line);
    (void)Exti::interrupt(line, false);
    bench.verdict("and it takes the software trigger, which is how the wake "
                  "path is proved with no supply to move",
                  quiet && fired && !Exti::pending(line));

    // ---- the wake-up pins ----------------------------------------------------
    Pwr::clear_wakeup_flag();
    const bool quiet_flag = !Pwr::wakeup_flag();
    uint8_t high_pins = 0;
    for (uint8_t n = 1; n <= Pwr::wakeup_pin_count; ++n) {
        Pwr::clear_wakeup_flag();
        (void)Pwr::wakeup_pin(n, true);
        for (uint16_t i = 0; i < 2000u; ++i) {
        }
        const PwrWakeupPad pad = Pwr::wakeup_pad(n);
        const bool raised = Pwr::wakeup_flag();
        if (raised) {
            ++high_pins;
        }
        print(serial, "  WKUP", static_cast<uint32_t>(n));
        if (pad.known) {
            print(serial, " (P", static_cast<char>(pad.port), static_cast<uint32_t>(pad.pin), ")");
        }
        print(serial, " armed: enabled ", Pwr::wakeup_pin_enabled(n) ? "yes" : "NO",
              ", WUF ", raised ? "SET - the pad is already high, and 5.4.2 says "
                                 "an enable on a high pad is itself an event"
                               : "clear",
              crlf);
        (void)Pwr::wakeup_pin(n, false);
    }
    Pwr::clear_wakeup_flag();
    bench.verdict("the one wake-up flag this family has is clearable and stays "
                  "down with nothing armed",
                  quiet_flag && !Pwr::wakeup_flag());
    bench.verdict("every bonded pin arms and disarms",
                  !Pwr::wakeup_pin_enabled(1) && high_pins <= Pwr::wakeup_pin_count);
    // The erratum's own sequence, run for its own sake: it must leave
    // every pin as it found it and the flags down.
    (void)Pwr::wakeup_pin(1, true);
    Pwr::prepare_standby();
    const bool kept = Pwr::wakeup_pin_enabled(1);
    (void)Pwr::wakeup_pin(1, false);
    Pwr::clear_wakeup_flags();
    bench.verdict("ES0298 2.2.4's sequence disables, clears and RE-ENABLES - "
                  "an armed pin survives it",
                  kept);

    // ---- the backup regulator ------------------------------------------------
    const bool unlocked = RtcDomain::unlock(true);
    const bool bre = Pwr::backup_regulator(true);
    print(serial, "  the backup regulator: BRE ", Pwr::backup_regulator() ? "set" : "clear",
          ", BRR ", Pwr::backup_regulator_ready() ? "ready" : "not ready",
          "; this part ", Pwr::has_backup_sram ? "has" : "has NO", " backup SRAM behind it",
          crlf);
    bench.verdict("the backup regulator comes up and reports ready", unlocked && bre &&
                                                                        Pwr::backup_regulator_ready());
    (void)Pwr::backup_regulator(false);
    bench.verdict("and goes down again", !Pwr::backup_regulator());
    if constexpr (Pwr::has_backup_sram) {
        bench.verdict("its array's own AHB1 gate opens and closes",
                      Pwr::backup_sram_clock(true) && Pwr::backup_sram_clock());
        (void)Pwr::backup_sram_clock(false);
    }

