uliano/brio/stm32f4/src/apps/test_stm32f4_power.cpp
    // ---- what is offered and never used --------------------------------------
    print(serial, "  offered and never set here: FISSR/FMSSR ",
          Pwr::has_flash_stop_while_run ? "present" : "absent",
          " (5.4.1: they cannot be set while executing from the flash itself), "
          "ADCDC1 ", Pwr::has_adc_dc1 ? "present" : "absent",
          " (AN4073's), SLEEPONEXIT and SEVONPEND ", Pwr::sleep_on_exit() ? "SET" : "clear",
          "/", Pwr::event_on_pending() ? "SET" : "clear", crlf);
    bench.verdict("the Cortex's two other sleep bits are clear, as brio's idle "
                  "path needs them",
                  !Pwr::sleep_on_exit() && !Pwr::event_on_pending());
    print(serial, "  at boot: SBF ",
          sbf_at_boot ? "SET (the last boot came out of Standby)" : "clear", ", WUF ",
          wuf_at_boot ? "SET" : "clear", ", the reset flags ", hex(reset_flags_at_boot), crlf);
}

// =============================================================================
// s - STANDBY, by name only: the wake is a reboot
// =============================================================================
constexpr uint32_t standby_token = 0x5B0DDBEEu;
constexpr uint8_t standby_slot = 3;

void ts_standby() {
    feed();
    if (!RtcDomain::unlock(true)) {
        bench.verdict("the domain unlocks so the token can be left", false);
        return;
    }
    print(serial, "  writing the token, arming the RTC 2 s out and entering "
                  "STANDBY: the 1.2 V domain goes off and the wake is a RESET. "
                  "The banner after it is the answer.", crlf);
    console_drain();

    (void)Rtc::backup(standby_slot, standby_token);
    // 5.3.7's safe sequence, and ES0298 2.2.4's on top of it: the RTC's
    // own flag down and its interrupt re-enabled around the PWR flag's
    // clear, then every wake-up source re-armed, then the entry.
    Rtc::clear_wakeup();
    Pwr::clear_wakeup_flags();
    (void)Rtc::set_wakeup(RtcWakeupClock::ck_spre, 1u, true);
    Nvic::enable(Rtc::wakeup_irq());
    Pwr::enter(PwrMode::standby);

    // Only reached when the entry did not happen (fact 3 of pwr.hpp: a
    // standing flag makes it a no-op).
    Rtc::clear_wakeup();
    bench.verdict("STANDBY was entered", false);
    print(serial, "  the entry fell through - PWR_CSR ", hex(Pwr::csr()),
          ", RTC ISR ", hex(Rtc::status()), crlf);
}

void banner() {
    print(serial, crlf, "test_stm32f4_power - PWR, the sleep sites and the dynamic clock",
          crlf);
    bench.menu();
}

}   // namespace

// ---- target glue ------------------------------------------------------------
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif
extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

extern "C" void RTC_WKUP_IRQHandler() {
    if (site_owns_wakeup) {
        TimedSite::isr();
        if (kernel_running) {
            brio::post<Probe>(Woke{});
        }
        return;
    }
    // THE MANUAL PATH DOES NOT RESTORE THE CLOCK, on purpose: letter c
    // reads SWS at the first instruction after the wake and would find
    // the PLL back if this body had put it there.
    const uint32_t served = brio::Rtc::wakeup_isr();
    if (served != 0u) {
        wakeup_count = static_cast<uint16_t>(wakeup_count + 1u);
        if (kernel_running) {
            brio::post<Probe>(Woke{});
        }
    }
}

int main() {
    dbg_sleep_at_boot = brio::Pwr::debug_in_sleep();
    dbg_stop_at_boot = brio::Pwr::debug_in_stop();
    dbg_standby_at_boot = brio::Pwr::debug_in_standby();
    reset_flags_at_boot = brio::Reset::flags();
    brio::Pwr::bus_clock(true);
    sbf_at_boot = brio::Pwr::standby_flag();
    wuf_at_boot = brio::Pwr::wakeup_flag();

    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    Led::output(true);
    brio::enable_interrupts();

    // The three debug bits come down before anything is measured: what a
    // probe left there would keep HCLK alive through a Stop and fake
    // every number in this suite (pwr.hpp fact 6, ES0298 2.2.1).
    brio::Pwr::debug_low_power(false);

    // The RTC, as the wall clock AND as the timed site's instrument: one
    // init for both, because the site owns the whole peripheral.
    const bool rtc_ok = TimedSite::init();
    brio::Nvic::disable(brio::Rtc::wakeup_irq());

    // The backstop: about 32 s at the nominal LSI, and no way off.
    feed_iwdg = brio::Iwdg::arm({brio::IwdgPrescaler::div256, 0x0FFFu});

    bench.letter('a', "the block and the ladder", ta_block);
    bench.letter('b', "Sleep: the tick runs through it", tb_sleep);
    bench.letter('c', "a Stop: the frozen tick and the clock that comes back", tc_stop);
    bench.letter('d', "the regulator variants weighed", td_variants);
    bench.letter('e', "the SYSCLK restore", te_restore);
    bench.letter('f', "the DynamicClock ladder, up and down", tf_ladder);
    bench.letter('g', "a Stop through a real kernel", tg_kernel_stop);
    bench.letter('h', "the timed site: the deadline met on the wall", th_timed_site);
    bench.letter('i', "the surface nothing here can stage", ti_surface);
    bench.letter('s', "STANDBY: the wake is a reboot", ts_standby, false);

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED", " ",
                    SysClock::hz(), " Hz tick=", tick_ok ? "SysTick" : "FAILED",
                    " rtc=", rtc_ok ? "up" : "FAILED",
                    " wdt=", feed_iwdg ? "IWDG" : "FAILED", brio::crlf);
        if (sbf_at_boot) {
            const uint32_t token = brio::Rtc::backup(standby_slot);
            brio::print(serial, "standby: SBF was set at boot and the backup "
                                "register reads ",
                        brio::hex(token), " - ",
                        token == standby_token ? "pass, the device woke from STANDBY "
                                                 "through the reset vector"
                                               : "FAIL, the token did not survive",
                        brio::crlf);
            brio::Pwr::clear_standby_flag();
            brio::Pwr::clear_wakeup_flag();
            (void)brio::Rtc::backup(standby_slot, 0u);
        }
        banner();
        bench.prompt();
    }

    for (;;) {
        feed();
        uint8_t c = 0;
        if (!Serial::read_byte(c)) {
            continue;
        }
        if (c == '\r' || c == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(c), brio::crlf);
        if (c == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(c))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
